#+title: Content
#+author: Timm Behner
#+date: <2023-01-27 Fri>
#+OPTIONS: H:3

*** Hello Rust
#+begin_src rust
// src/main.rs
fn main() {
    println!("Hello, world!");
}
#+end_src

#+RESULTS:
: Hello, world!

*** Variablen deklarieren
- Deklaration und Initialisierung
    #+begin_src rust
    let x: usize = 5;
    println!("x has value {x}");
    #+end_src

    #+RESULTS:
    : x has value 5

- Deklaration mit späterer Initialisierung
  #+begin_src rust
    let x: usize;
    x = 5;
    println!("x has value {x}");
    #+end_src

#+RESULTS:
: x has value 5
*** mut Vec
Modifizierende Operationen nur auf mutable Vec:

#+begin_src rust
let mut values = vec![1, 2, 3];
values.push(4); // \rightarrow [1, 2, 3, 4]
values.extend(vec![2, 1]); // \rightarrow [1, 2, 3, 4, 2, 1]
values.pop(); // \rightarrow [1, 2, 3, 4, 2]
values.sort(); // \rightarrow [1, 2, 2, 3, 4]
dbg!(values);
#+end_src

#+RESULTS:
: [src/main.rs:8] values = [
:     1,
:     2,
:     2,
:     3,
:     4,
: ]

- Erweitern
- Löschen
- Sortieren

*** String (src_rust{std::string::String})
  #+begin_src rust
let greeting = String::from("Hello, World!");
dbg!(greeting.len()); // \rightarrow 13
dbg!(greeting.to_lowercase()); // \rightarrow "hello, world!"
dbg!(greeting.as_bytes()); // \rightarrow [72, 101, 108, 108, 111, 44, 32, 87, 111, 114, 108, 100, 33]
  #+end_src

  #+RESULTS:
  #+begin_example
  [src/main.rs:4] greeting.len() = 13
  [src/main.rs:5] greeting.to_lowercase() = "hello, world!"
  [src/main.rs:6] greeting.as_bytes() = [
      72,
      101,
      108,
      108,
      111,
      44,
      32,
      87,
      111,
      114,
      108,
      100,
      33,
  ]
  #+end_example

  - UTF-8 String
  - variable Länge und Inhalt
*** mut String
Modifizierende Operationen auf Strings
#+begin_src rust
let mut greeting = String::from("Hello, ");
greeting.push('W');
greeting.push_str("orld!");
dbg!(greeting);
#+end_src

#+RESULTS:
: [src/main.rs:6] greeting = "Hello, World!"

*** Funktionen definieren und aufrufen
#+begin_src rust
fn say_hello() {
    println!("Hello, World!");
}

fn main() {
    say_hello();
}
#+end_src

#+RESULTS:
: Hello, World!

*** Parameter und Rückgabewert
#+begin_src rust
fn greet(greeting: String, subject: String) {
    println!("{greeting}, {subject}!")
}
dbg!(greet("Hello".into(), "World".into()));
#+end_src

#+RESULTS:
: Hello, World!
: [src/main.rs:6] greet("Hello".into(), "World".into()) = ()

#+begin_src rust
fn add_one(x: usize) -> usize {
    return x + 1;
}
dbg!(add_one(41));
#+end_src

#+RESULTS:
: [src/main.rs:6] add_one(41) = 42

*** Bedingte Ausführung
#+begin_src rust
if /*condition*/ {
    /*true case*/
} else {
    /*false case*/
}
#+end_src
- src_rust{if} sind Ausdrücke
  #+begin_src rust
let y = 10;
let x = if y == 5 {
    y
} else {
    y + 1
};
dbg!(x);
  #+end_src

  #+RESULTS:
  : [src/main.rs:9] x = 11

*** Mehrere Bedingungen
#+begin_src rust
let number = 49;
if number % 2 == 0 {
   println!("{number} is not a prime");
} else if number % 3 == 0 {
   println!("{number} is not a prime");
} else if number % 5 == 0 {
   println!("{number} is not a prime");
} else {
   println!("{number} is probably a prime");
}
#+end_src

#+RESULTS:
: 49 is probably a prime

*** Loops
- Endlos-Schleifen
#+begin_src rust
loop {
    println!("Sind wir bald da?");
}
#+end_src
- Schleifen sind Ausdrücke
  #+begin_src rust
let arr = [1, 3, 4];
let mut counter = 0;
let final_value = loop {
   if arr[counter] % 2 != 0  {
       break arr[counter] * 2
   }
    counter += 1;
};
dbg!(final_value);
  #+end_src

  #+RESULTS:
  : [src/main.rs:11] final_value = 2

*** While-Loops
#+begin_src rust
let mut counter = 5;
let mut factorial = 1;
while counter > 1 {
    factorial *= counter;
    counter -= 1;
}
println!("5! = {factorial}")
#+end_src

#+RESULTS:
: 5! = 120

- =while= ist *kein* Ausdruck, sondern eine Anweisung

*** For-Loops
Iteration über eine Kollektion zu Iterieren
#+begin_src rust
let a = [1, 2, 3, 4];
for x in a {
    println!("{x}")
}
#+end_src

#+RESULTS:
: 1
: 2
: 3
: 4

*** Copy on assignment
#+begin_src rust
{
    let s = "hello";
    let f = s;
    println!("{}, {}!", s, f);
}
#+end_src

#+RESULTS:
: hello, hello!

*** Ownership und Funktionen
#+begin_src rust
fn greet(name: String) -> String {
    let mut greeting = String::from("Hello, ");
    greeting.push_str(&name);
    greeting.push('!');
    greeting
}

fn main() {
    let name = "Thorsten".to_string();
    let greeting = greet(name);
    dbg!(greeting);
}
#+end_src

#+RESULTS:
: [src/main.rs:12] greeting = "Hello, Thorsten!"

*** Heap vs Stack
- src_rust[]{String} auf dem Heap
#+begin_src rust
{
    let s = String::from("hello");
    let f = s;                     // value moved here
    println!("{}, {}!", s, f);      // Error -- value borrowed here after move
}
#+end_src

#+RESULTS:
: error: Could not compile `cargoUbyibw`.

*** Referenzen
Konstante Pointer:
#+begin_src rust
{
    let s = String::from("hello");
    let f = &s; // -> &String
    println!("{}, {}!", s, f);
}
#+end_src

#+RESULTS:
: hello, hello!

Dereferenzieren mit src_rust{*}
#+begin_src rust
let v: usize = 5; // type: usize
let r = &v; // type: &usize
assert_eq!(v, *r);
dbg!(*r);
#+end_src

#+RESULTS:
: [src/main.rs:6] *r = 5

*** Veränderbare Referenzen
Referenzen *mit* Schreibe-Zugriff
#+begin_src rust
{
    let mut s = String::from("hello");
    let f = &mut s;
    f.push_str(" there, General Kenobi!");
    println!("{f}");
}
#+end_src

#+RESULTS:
: hello there, General Kenobi!

Alles hat Grenzen!
#+begin_src rust
{
    let mut s = String::from("hello");
    let f = &mut s;
    f.push_str(" there, General Kenobi!");
    println!("{}, {}!", s, f); // Error
    // error[E0502]: cannot borrow `x` as immutable because it is also borrowed as mutable
}
#+end_src

#+RESULTS:
: error: Could not compile `cargo6bwFtE`.

Zu jeder Zeit kann es entweder:
- eine veränderbare (mutable) Referenz
- oder eine beliebige Anzahl von nicht-veränderbaren Referenzen geben

*** Slices und Ownership
Slices sind eine Referenz auf einen Teil einer Kollektion
- String Slices src_rust{&str}
    #+begin_src rust
    let s = String::from("Hello, World!");

    dbg!(&s[0..5]);
    dbg!(&s[7..12]);
    #+end_src

    #+RESULTS:
    : [src/main.rs:5] &s[0..5] = "Hello"
    : [src/main.rs:6] &s[7..12] = "World"

- General Slices  src_rust{&[T]}
  #+begin_src rust
let v = vec![1, 2, 3];
dbg!(&v[1..2]);
  #+end_src

  #+RESULTS:
  : [src/main.rs:4] &v[1..2] = [
  :     2,
  : ]

*** Explizite Lebenszeit
- alle bisherigen Refernezen hatten eine implizite Lebenszeit

    #+begin_src rust
    fn get_first(input: &str) -> &str {
        &input[0..1]
    }
    #+end_src

- explizite Lebenszeit

    #+begin_src rust
    fn get_first<'a>(input: &'a str) -> &'a str {
        &input[0..1]
    }
    #+end_src

- manchmal notwendig

    #+begin_src rust

    fn multiple_lifetimes(first: &str, second: &str) -> &str {
        first
    }

    let v = "I'm on the stack";
    {
        let a = String::from("look, I'm on the heap!");
        let result = multiple_lifetimes(v, &a);
        assert_eq!(result, v);
    }

    #+end_src

    #+RESULTS:
    : error: Could not compile `cargo7hzoB2`.

*** Matching auf Enums mit Variablen-Bindung
#+begin_src rust
enum Color {RGB(u8, u8, u8), HEX(String)}
let white = Color::RGB(255, 255, 255);
match white {
    Color::HEX(value) => println!("hex value with #{value}"),
    Color::RGB(r, g, _) => println!("This color is {r} red,  {g} green, and some blue"),
}
#+end_src

#+RESULTS:
: This color is 255 red,  255 green, and some blue

- Bindung an Variablen
- Ownership-Regeln gelten
*** Match-Pattern
- Überprüfung von gebundenen Variablen
  #+begin_src rust
    let k = Ok(5);
    match k {
        Ok(v) if v % 2 == 0 => println!("even result"),
        Ok(v)  => println!("odd result"),
        Err(_) => println!("some error"),
    }
  #+end_src

- Ranges
  #+begin_src rust
    let v = 5;
    match v {
        1..=5 => println!("a number between 1 and 5"),
        _ => println!("some different number"),
    }
  #+end_src

  #+RESULTS:
  : a number between 1 and 5

- Alternativen
    #+begin_src rust
    let c = 'q';
    match c {
        'q' | 'Q' => println!("quit"),
        _ => println!("some action"),
    }
    #+end_src

    #+RESULTS:
    : quit

*** Behebbare Fehler repräsentieren
#+begin_src rust
enum Result<T, E> {
    Ok(T),
    Err(E)
}
#+end_src

Fehler behandeln:
#+begin_src rust
use std::fs;
let open_result = fs::File::open("some_file.txt");
let f = match open_result {
    Ok(some_file) => some_file,
    Err(e) => panic!("Could not open file!"),
};
#+end_src

#+RESULTS:
: thread 'main' panicked at 'Could not open file!', src/main.rs:7:15

*** Nicht-behebbare Fehler
- src_rust{panic}-Macro zum Beenden des Prozesses
  #+begin_src rust
  panic!("that was not okay!");
  #+end_src
- src_rust{Result} in src_rust{panic} umwandeln
  #+begin_src rust
  let v: Result<String, String> = Ok("Ok...".into());
  let r: Result<String, String> = Err("This is wrong!".into());

  let correct_string: String = v.expect("a valid string");
  r.expect("That this blows up!"); // KABOOM!
  #+end_src

  #+RESULTS:
  : thread 'main' panicked at 'That this blows up!: "This is wrong!"', src/main.rs:7:5

*** Closures und Ownership
- Referenz auf Wert aus Umgebung
  #+begin_src rust
    let x = vec![1, 2, 3];
    let first = || {x.len()};
    dbg!(first());
  #+end_src

  #+RESULTS:
  : [src/main.rs:5] first() = 3

- Mutable Referenz auf Wert aus Umgebung
  #+begin_src rust
    let mut x = vec![1, 2, 3];
    let mut second = || {x.push(4)}; // second: FnMut, x: &mut Vec
    second();
    x.len(); // 4
  #+end_src

- Besitz übernehmen
  #+begin_src rust
    let mut x = vec![1, 2, 3];
    let third = move || {x.push(4); x.len()};
    third(); // 4
    x.len(); // Error
  #+end_src

